{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "in": 257,
      "th": 258,
      "on": 259,
      "Ġa": 260,
      "Ġc": 261,
      "Ġin": 262,
      "Ġth": 263,
      "is": 264,
      "at": 265,
      "re": 266,
      "Ġd": 267,
      "yth": 268,
      "ĠP": 269,
      "ython": 270,
      "le": 271,
      "ĠPython": 272,
      "ing": 273,
      "an": 274,
      "Ġl": 275,
      "Ġthe": 276,
      "Ġf": 277,
      "us": 278,
      "ct": 279,
      "ke": 280,
      "Ġm": 281,
      "ion": 282,
      "ow": 283,
      "er": 284,
      "or": 285,
      "\",": 286,
      ",\"": 287,
      "\",,\"": 288,
      "?\",,\"": 289,
      "ate": 290,
      "it": 291,
      "ou": 292,
      "Ġus": 293,
      "ĠI": 294,
      "Ġdo": 295,
      "How": 296,
      "va": 297,
      "You": 298,
      "en": 299,
      "Ġb": 300,
      "Ġusing": 301,
      "Ġcan": 302,
      "ike": 303,
      "Ġthis": 304,
      "Ġlike": 305,
      "Ġan": 306,
      "Ġcre": 307,
      "Ġt": 308,
      "Ġcreate": 309,
      "la": 310,
      "Ġs": 311,
      "ction": 312,
      "od": 313,
      "Ġp": 314,
      "om": 315,
      "Ġo": 316,
      "es": 317,
      "pt": 318,
      "ri": 319,
      "ss": 320,
      "Ġ=": 321,
      "Ġre": 322,
      "ist": 323,
      "lass": 324,
      "ĠJ": 325,
      "Ġis": 326,
      "ava": 327,
      "un": 328,
      "ĠJava": 329,
      "Ġe": 330,
      "unction": 331,
      "Ġclass": 332,
      "st": 333,
      "ck": 334,
      "Ġi": 335,
      "Ġn": 336,
      "()": 337,
      "ce": 338,
      "Ġfunction": 339,
      "Ġw": 340,
      "cri": 341,
      "ll": 342,
      "me": 343,
      "Ġde": 344,
      "ent": 345,
      "Ġto": 346,
      "cript": 347,
      "Script": 348,
      "ar": 349,
      "ch": 350,
      "ĠĠ": 351,
      "Ġmy": 352,
      "ĠJavaScript": 353,
      "ile": 354,
      "ver": 355,
      "key": 356,
      "et": 357,
      "Ġcon": 358,
      "ed": 359,
      "lu": 360,
      "Ġcom": 361,
      "Ġby": 362,
      "Ġdef": 363,
      "ment": 364,
      "Ġva": 365,
      "Ġkey": 366,
      "Ġlist": 367,
      "mp": 368,
      "ra": 369,
      "thod": 370,
      "Ġand": 371,
      "Ġit": 372,
      "Ġdi": 373,
      "ort": 374,
      "Ġex": 375,
      ".\"": 376,
      "Ġas": 377,
      "and": 378,
      "lo": 379,
      "se": 380,
      "Ġme": 381,
      ")\"": 382,
      "ul": 383,
      "yn": 384,
      "Ġ'": 385,
      "Ġfile": 386,
      "Ġmod": 387,
      "Ġmethod": 388,
      "ab": 389,
      "ith": 390,
      "rom": 391,
      "Ġh": 392,
      "Ġpa": 393,
      "Wh": 394,
      "ame": 395,
      "Ġch": 396,
      "Ġfor": 397,
      "ctionar": 398,
      "Ġwith": 399,
      "Ġdictionar": 400,
      "ult": 401,
      "able": 402,
      "Ġdictionary": 403,
      "al": 404,
      "ple": 405,
      "ring": 406,
      "Ġof": 407,
      "cept": 408,
      "Ġvalu": 409,
      "Ġmodu": 410,
      "What": 411,
      "__": 412,
      "ge": 413,
      "mb": 414,
      "Ġle": 415,
      "Ġmodule": 416,
      "ew": 417,
      "Ġg": 418,
      "Ġy": 419,
      "Ġinst": 420,
      "Ġfrom": 421,
      "Ġst": 422,
      "ode": 423,
      "Ġimp": 424,
      "ception": 425,
      "all": 426,
      "di": 427,
      "qu": 428,
      "ran": 429,
      "ur": 430,
      "wor": 431,
      "lement": 432,
      "Ġop": 433,
      "Ġif": 434,
      "llow": 435,
      "Ġkeywor": 436,
      "Ġasyn": 437,
      "andle": 438,
      "Ġstring": 439,
      "dict": 440,
      "Ġkeyword": 441,
      "ad": 442,
      "ax": 443,
      "eck": 444,
      "op": 445,
      "pe": 446,
      "ve": 447,
      "ine": 448,
      "Ġcode": 449,
      "Ġint": 450,
      "Ġthat": 451,
      "ite": 452,
      "Ġcomm": 453,
      "Ġcheck": 454,
      "Ġinstall": 455,
      "Ġimport": 456,
      "ranch": 457,
      "('": 458,
      "ect": 459,
      "list": 460,
      "ot": 461,
      "ata": 462,
      "ation": 463,
      "Ġblo": 464,
      "Ġbranch": 465,
      "cka": 466,
      "Ġiter": 467,
      "Ġexception": 468,
      "Ġhandle": 469,
      "Ġpacka": 470,
      "Ġblock": 471,
      ":\"": 472,
      ";\"": 473,
      "HT": 474,
      "TP": 475,
      "bj": 476,
      "da": 477,
      "oop": 478,
      "ĠG": 479,
      "Ġloop": 480,
      "riable": 481,
      "ists": 482,
      "Ġnew": 483,
      "Ġvalues": 484,
      "mbda": 485,
      "Ġlet": 486,
      "Ġyou": 487,
      "HTTP": 488,
      "bject": 489,
      "ip": 490,
      "ly": 491,
      "ollow": 492,
      "pre": 493,
      "ron": 494,
      "rite": 495,
      "Ġ{": 496,
      "Ġor": 497,
      "one": 498,
      "Ġab": 499,
      "Ġar": 500,
      "ren": 501,
      "Ġfollow": 502,
      "erver": 503,
      "Ġover": 504,
      "Ġobject": 505,
      "est": 506,
      "Ġelement": 507,
      "ĠĠĠĠ": 508,
      "lue": 509,
      "ray": 510,
      "Ġgit": 511,
      "quest": 512,
      "Ġpackage": 513,
      "ĠGit": 514,
      "',": 515,
      "ap": 516,
      "ault": 517,
      "ambda": 518,
      "ci": 519,
      "de": 520,
      "ex": 521,
      "een": 522,
      "file": 523,
      "ime": 524,
      "ove": 525,
      "pon": 526,
      "uple": 527,
      "ween": 528,
      "ype": 529,
      "}\"": 530,
      "ĠHTTP": 531,
      "Ġcl": 532,
      "ator": 533,
      "ance": 534,
      "Ġlambda": 535,
      "Ġmult": 536,
      "value": 537,
      "Ġbe": 538,
      "Ġbet": 539,
      "Ġtype": 540,
      "Ġsort": 541,
      "Ġpla": 542,
      "Ġrem": 543,
      "Ġres": 544,
      "Ġread": 545,
      "Ġname": 546,
      "Ġconc": 547,
      "Ġvariable": 548,
      "Ġexists": 549,
      "Ġopen": 550,
      "Ġcommand": 551,
      "Ġfollowed": 552,
      "Ġmulti": 553,
      "Ġbetween": 554,
      "My": 555,
      "ait": 556,
      "cing": 557,
      "ces": 558,
      "ld": 559,
      "name": 560,
      "ous": 561,
      "po": 562,
      "sv": 563,
      "tt": 564,
      "tur": 565,
      "tax": 566,
      "ut": 567,
      "vi": 568,
      "wait": 569,
      "Ġ+": 570,
      "Ġ2": 571,
      "Ġ3": 572,
      "Ġen": 573,
      "Ġ__": 574,
      "ĠMy": 575,
      "init": 576,
      "Ġdate": 577,
      "Ġdata": 578,
      "ctor": 579,
      "ĠIt": 580,
      "Ġset": 581,
      "Ġsyn": 582,
      "Ġpr": 583,
      "Ġretur": 584,
      "stra": 585,
      "Ġnu": 586,
      "Ġwrite": 587,
      "chron": 588,
      "ĠĠĠ": 589,
      "vert": 590,
      "Ġconst": 591,
      "Ġconvert": 592,
      "Ġcomment": 593,
      "Ġdefault": 594,
      "Ġvalue": 595,
      "Ġasynchron": 596,
      "ponse": 597,
      "Ġsyntax": 598,
      "Ġreturn": 599,
      "stract": 600,
      "Ġasynchronous": 601,
      "')": 602,
      "')\"": 603,
      "):": 604,
      ");": 605,
      "Class": 606,
      "Ex": 607,
      "ain": 608,
      "em": 609,
      "function": 610,
      "nate": 611,
      "pa": 612,
      "pp": 613,
      "ru": 614,
      "row": 615,
      "sit": 616,
      "tain": 617,
      "Ġ(": 618,
      "Ġ1": 619,
      "ĠC": 620,
      "ĠS": 621,
      "Ġcur": 622,
      "ust": 623,
      "Ġmax": 624,
      "ory": 625,
      "atenate": 626,
      "Ġuse": 627,
      "Ġused": 628,
      "Ġbra": 629,
      "Ġtuple": 630,
      "Ġpip": 631,
      "Ġrepo": 632,
      "()\"": 633,
      "Ġwh": 634,
      "Ġdec": 635,
      "Ġdefine": 636,
      "Ġitem": 637,
      "Ġlen": 638,
      "Ġoper": 639,
      "Ġasync": 640,
      "Ġarray": 641,
      "rent": 642,
      "Ġplacing": 643,
      "Ġremove": 644,
      "Ġconcatenate": 645,
      "Ġmultiple": 646,
      "sitory": 647,
      "Ġrepository": 648,
      "fi": 649,
      "ges": 650,
      "her": 651,
      "hen": 652,
      "ig": 653,
      "im": 654,
      "line": 655,
      "mm": 656,
      "my": 657,
      "new": 658,
      "oth": 659,
      "par": 660,
      "ry": 661,
      "sion": 662,
      "tx": 663,
      "time": 664,
      "Ġ`": 665,
      "inst": 666,
      "Ġallow": 667,
      "Ġapp": 668,
      "Ġcsv": 669,
      "let": 670,
      "Ġfet": 671,
      "Ġflo": 672,
      "ush": 673,
      "Ġmer": 674,
      "erf": 675,
      "ated": 676,
      "end": 677,
      "Ġtry": 678,
      "Ġspe": 679,
      "Ġserver": 680,
      "Ġpush": 681,
      "Ġos": 682,
      "Ġ=>": 683,
      "Ġrequest": 684,
      "Ġnot": 685,
      "method": 686,
      "Ġcontain": 687,
      "Ġcompre": 688,
      "mple": 689,
      "separ": 690,
      "Ġmethods": 691,
      "mber": 692,
      "Ġcomma": 693,
      "ations": 694,
      "Ġiterate": 695,
      "Ġiterable": 696,
      "Ġexceptions": 697,
      "Ġabstract": 698,
      "Ġclone": 699,
      "ttp": 700,
      "ĠMyClass": 701,
      "Ġdatetime": 702,
      "Ġconstru": 703,
      "herit": 704,
      "hension": 705,
      "txt": 706,
      "instance": 707,
      "Ġfetch": 708,
      "Ġfloat": 709,
      "Ġmerge": 710,
      "Ġspeci": 711,
      "Ġcomprehension": 712,
      "separated": 713,
      "Ġconstructor": 714,
      "''": 715,
      "):\"": 716,
      ");\"": 717,
      "._": 718,
      "//": 719,
      "He": 720,
      "In": 721,
      "ace": 722,
      "await": 723,
      "con": 724,
      "dd": 725,
      "data": 726,
      "eg": 727,
      "gth": 728,
      "his": 729,
      "ie": 730,
      "iz": 731,
      "ich": 732,
      "ide": 733,
      "lf": 734,
      "ls": 735,
      "mpt": 736,
      "pm": 737,
      "sponse": 738,
      "side": 739,
      "ub": 740,
      "ual": 741,
      "Ġ*": 742,
      "Ġ-": 743,
      "Ġ[": 744,
      "Ġ}\"": 745,
      "int": 746,
      "ines": 747,
      "Ġawait": 748,
      "Ġadd": 749,
      "Ġinherit": 750,
      "Ġinside": 751,
      "ise": 752,
      "response": 753,
      "inglet": 754,
      "Ġlit": 755,
      "Ġma": 756,
      "Ġmap": 757,
      "eral": 758,
      "orator": 759,
      "env": 760,
      "Ġanoth": 761,
      "Ġtime": 762,
      "Ġcreated": 763,
      "lar": 764,
      "lare": 765,
      "Ġpar": 766,
      "Ġprom": 767,
      "ssion": 768,
      "Ġempt": 769,
      "string": 770,
      "Ġimm": 771,
      "Ġnpm": 772,
      "llo": 773,
      "arg": 774,
      "mpy": 775,
      "self": 776,
      "Ġha": 777,
      "Ġhttp": 778,
      "Ġchan": 779,
      "__(": 780,
      "Ġstrings": 781,
      "Ġinterf": 782,
      "Ġinteg": 783,
      "item": 784,
      "Ġloops": 785,
      "pression": 786,
      "ĠĠĠĠĠĠĠ": 787,
      "Ġcls": 788,
      "Ġresponse": 789,
      "utable": 790,
      "Ġnumber": 791,
      "Ġnumpy": 792,
      "Ġdefaultdict": 793,
      "Exception": 794,
      "Ġ10": 795,
      "Ġcurly": 796,
      "ustom": 797,
      "Ġbraces": 798,
      "Ġwhich": 799,
      "Ġdeclare": 800,
      "Ġlength": 801,
      "Ġoperations": 802,
      "Ġappend": 803,
      "Hello": 804,
      "ingleton": 805,
      "Ġliteral": 806,
      "Ġanother": 807,
      "Ġempty": 808,
      "Ġimmutable": 809,
      "Ġinterface": 810,
      "${": 811,
      "'\"": 812,
      "':": 813,
      ".\",": 814,
      "00": 815,
      "12": 816,
      ":\\": 817,
      "://": 818,
      "AB": 819,
      "Ar": 820,
      "ET": 821,
      "Fal": 822,
      "Handle": 823,
      "None": 824,
      "OS": 825,
      "Re": 826,
      "SV": 827,
      "Server": 828,
      "Wor": 829,
      "]\"": 830,
      "are": 831,
      "avi": 832,
      "ample": 833,
      "but": 834,
      "cat": 835,
      "cke": 836,
      "com": 837,
      "cap": 838,
      "csv": 839,
      "cls": 840,
      "ding": 841,
      "emp": 842,
      "element": 843,
      "fe": 844,
      "fy": 845,
      "ffe": 846,
      "gu": 847,
      "gra": 848,
      "ht": 849,
      "havi": 850,
      "ic": 851,
      "ial": 852,
      "ild": 853,
      "imple": 854,
      "jo": 855,
      "js": 856,
      "king": 857,
      "lle": 858,
      "late": 859,
      "min": 860,
      "mor": 861,
      "ning": 862,
      "now": 863,
      "ore": 864,
      "ole": 865,
      "oly": 866,
      "olle": 867,
      "py": 868,
      "pip": 869,
      "phis": 870,
      "rt": 871,
      "run": 872,
      "rce": 873,
      "su": 874,
      "set": 875,
      "sed": 876,
      "sort": 877,
      "sul": 878,
      "server": 879,
      "sole": 880,
      "ts": 881,
      "ter": 882,
      "tex": 883,
      "tuple": 884,
      "um": 885,
      "up": 886,
      "venv": 887,
      "Ġ0": 888,
      "Ġ4": 889,
      "Ġ<": 890,
      "Ġ@": 891,
      "ĠT": 892,
      "Ġx": 893,
      "ĠYou": 894,
      "Ġone": 895,
      "Ġvi": 896,
      "Ġ${": 897,
      "ĠFal": 898,
      "ĠNone": 899,
      "Ġrun": 900,
      "Ġvenv": 901,
      "ind": 902,
      "then": 903,
      "thes": 904,
      "Ġat": 905,
      "Ġatt": 906,
      "Ġcustom": 907,
      "Ġcolle": 908,
      "Ġinit": 909,
      "Ġthrow": 910,
      "read": 911,
      "rector": 912,
      "ĠPOS": 913,
      "Ġline": 914,
      "Ġlines": 915,
      "Ġfind": 916,
      "Ġmig": 917,
      "erator": 918,
      "ermin": 919,
      "ity": 920,
      "ource": 921,
      "Ġdoes": 922,
      "enerator": 923,
      "Ġtemp": 924,
      "Ġtermin": 925,
      "lambda": 926,
      "Ġsame": 927,
      "Ġsqu": 928,
      "Ġsingleton": 929,
      "ctions": 930,
      "Ġpython": 931,
      "rime": 932,
      "ribut": 933,
      "Ġrever": 934,
      "():\"": 935,
      "ced": 936,
      "Ġfunctions": 937,
      "ents": 938,
      "Ġconsole": 939,
      "Ġcompa": 940,
      "Ġdefin": 941,
      "Ġdefinit": 942,
      "ments": 943,
      "Ġdiffe": 944,
      "Ġdirector": 945,
      "Ġexpression": 946,
      "log": 947,
      "load": 948,
      "Ġmode": 949,
      "Ġpass": 950,
      "Ġparen": 951,
      "Ġparent": 952,
      "Ġchild": 953,
      "__.": 954,
      "Ġget": 955,
      "Ġgenerator": 956,
      "Ġyie": 957,
      "Ġimplement": 958,
      "ote": 959,
      "Ġbranches": 960,
      "Ġhandles": 961,
      "Ġpackages": 962,
      "Ġblocks": 963,
      "Ġyour": 964,
      "HTTPRe": 965,
      "ronment": 966,
      "Ġabc": 967,
      "Ġargu": 968,
      "Ġoverload": 969,
      "Ġobjects": 970,
      "question": 971,
      "questHandle": 972,
      "def": 973,
      "exists": 974,
      "ĠHTTPServer": 975,
      "Ġbehavi": 976,
      "Ġsorted": 977,
      "Ġplaced": 978,
      "Ġremote": 979,
      "Ġresult": 980,
      "Ġresource": 981,
      "Ġreader": 982,
      "vironment": 983,
      "Ġensu": 984,
      "Ġenvironment": 985,
      "Ġpro": 986,
      "Ġprint": 987,
      "):\\": 988,
      "path": 989,
      "ĠCode": 990,
      "ĠCSV": 991,
      "ĠSet": 992,
      "ĠSimple": 993,
      "Ġcurrent": 994,
      "Ġmaxim": 995,
      "Ġbracke": 996,
      "Ġwhile": 997,
      "Ġdecorator": 998,
      "Ġarrays": 999
    },
    "merges": [
      "i n",
      "t h",
      "o n",
      "Ġ a",
      "Ġ c",
      "Ġ in",
      "Ġ th",
      "i s",
      "a t",
      "r e",
      "Ġ d",
      "y th",
      "Ġ P",
      "yth on",
      "l e",
      "ĠP ython",
      "in g",
      "a n",
      "Ġ l",
      "Ġth e",
      "Ġ f",
      "u s",
      "c t",
      "k e",
      "Ġ m",
      "i on",
      "o w",
      "e r",
      "o r",
      "\" ,",
      ", \"",
      "\", ,\"",
      "? \",,\"",
      "at e",
      "i t",
      "o u",
      "Ġ us",
      "Ġ I",
      "Ġd o",
      "H ow",
      "v a",
      "Y ou",
      "e n",
      "Ġ b",
      "Ġus ing",
      "Ġc an",
      "i ke",
      "Ġth is",
      "Ġl ike",
      "Ġa n",
      "Ġc re",
      "Ġ t",
      "Ġcre ate",
      "l a",
      "Ġ s",
      "ct ion",
      "o d",
      "Ġ p",
      "o m",
      "Ġ o",
      "e s",
      "p t",
      "r i",
      "s s",
      "Ġ =",
      "Ġ re",
      "is t",
      "la ss",
      "Ġ J",
      "Ġ is",
      "a va",
      "u n",
      "ĠJ ava",
      "Ġ e",
      "un ction",
      "Ġc lass",
      "s t",
      "c k",
      "Ġ i",
      "Ġ n",
      "( )",
      "c e",
      "Ġf unction",
      "Ġ w",
      "c ri",
      "l l",
      "m e",
      "Ġd e",
      "en t",
      "Ġt o",
      "cri pt",
      "S cript",
      "a r",
      "c h",
      "Ġ Ġ",
      "Ġm y",
      "ĠJava Script",
      "i le",
      "v er",
      "ke y",
      "e t",
      "Ġc on",
      "e d",
      "l u",
      "Ġc om",
      "Ġb y",
      "Ġde f",
      "m ent",
      "Ġ va",
      "Ġ key",
      "Ġl ist",
      "m p",
      "r a",
      "th od",
      "Ġan d",
      "Ġ it",
      "Ġd i",
      "or t",
      "Ġe x",
      ". \"",
      "Ġa s",
      "an d",
      "l o",
      "s e",
      "Ġm e",
      ") \"",
      "u l",
      "y n",
      "Ġ '",
      "Ġf ile",
      "Ġm od",
      "Ġme thod",
      "a b",
      "i th",
      "r om",
      "Ġ h",
      "Ġp a",
      "W h",
      "a me",
      "Ġc h",
      "Ġf or",
      "ction ar",
      "Ġw ith",
      "Ġdi ctionar",
      "ul t",
      "ab le",
      "Ġdictionar y",
      "a l",
      "p le",
      "r ing",
      "Ġo f",
      "ce pt",
      "Ġva lu",
      "Ġmod u",
      "Wh at",
      "_ _",
      "g e",
      "m b",
      "Ġ le",
      "Ġmodu le",
      "e w",
      "Ġ g",
      "Ġ y",
      "Ġin st",
      "Ġf rom",
      "Ġs t",
      "od e",
      "Ġi mp",
      "cept ion",
      "a ll",
      "d i",
      "q u",
      "r an",
      "u r",
      "w or",
      "le ment",
      "Ġo p",
      "Ġi f",
      "ll ow",
      "Ġkey wor",
      "Ġas yn",
      "and le",
      "Ġst ring",
      "di ct",
      "Ġkeywor d",
      "a d",
      "a x",
      "e ck",
      "o p",
      "p e",
      "v e",
      "in e",
      "Ġc ode",
      "Ġin t",
      "Ġth at",
      "it e",
      "Ġcom m",
      "Ġch eck",
      "Ġinst all",
      "Ġimp ort",
      "ran ch",
      "( '",
      "e ct",
      "l ist",
      "o t",
      "at a",
      "at ion",
      "Ġb lo",
      "Ġb ranch",
      "ck a",
      "Ġit er",
      "Ġex ception",
      "Ġh andle",
      "Ġpa cka",
      "Ġblo ck",
      ": \"",
      "; \"",
      "H T",
      "T P",
      "b j",
      "d a",
      "o op",
      "Ġ G",
      "Ġl oop",
      "ri able",
      "ist s",
      "Ġn ew",
      "Ġvalu es",
      "mb da",
      "Ġle t",
      "Ġy ou",
      "HT TP",
      "bj ect",
      "i p",
      "l y",
      "o llow",
      "p re",
      "r on",
      "r ite",
      "Ġ {",
      "Ġ or",
      "on e",
      "Ġa b",
      "Ġa r",
      "re n",
      "Ġf ollow",
      "er ver",
      "Ġo ver",
      "Ġo bject",
      "es t",
      "Ġe lement",
      "ĠĠ ĠĠ",
      "lu e",
      "ra y",
      "Ġg it",
      "qu est",
      "Ġpacka ge",
      "ĠG it",
      "' ,",
      "a p",
      "a ult",
      "a mbda",
      "c i",
      "d e",
      "e x",
      "e en",
      "f ile",
      "i me",
      "o ve",
      "p on",
      "u ple",
      "w een",
      "y pe",
      "} \"",
      "Ġ HTTP",
      "Ġc l",
      "at or",
      "an ce",
      "Ġl ambda",
      "Ġm ult",
      "va lue",
      "Ġb e",
      "Ġb et",
      "Ġt ype",
      "Ġs ort",
      "Ġp la",
      "Ġre m",
      "Ġre s",
      "Ġre ad",
      "Ġn ame",
      "Ġcon c",
      "Ġva riable",
      "Ġex ists",
      "Ġop en",
      "Ġcomm and",
      "Ġfollow ed",
      "Ġmult i",
      "Ġbet ween",
      "M y",
      "a it",
      "c ing",
      "c es",
      "l d",
      "n ame",
      "o us",
      "p o",
      "s v",
      "t t",
      "t ur",
      "t ax",
      "u t",
      "v i",
      "w ait",
      "Ġ +",
      "Ġ 2",
      "Ġ 3",
      "Ġ en",
      "Ġ __",
      "Ġ My",
      "in it",
      "Ġd ate",
      "Ġd ata",
      "ct or",
      "ĠI t",
      "Ġs et",
      "Ġs yn",
      "Ġp r",
      "Ġre tur",
      "st ra",
      "Ġn u",
      "Ġw rite",
      "ch ron",
      "ĠĠ Ġ",
      "ver t",
      "Ġcon st",
      "Ġcon vert",
      "Ġcom ment",
      "Ġdef ault",
      "Ġvalu e",
      "Ġasyn chron",
      "pon se",
      "Ġsyn tax",
      "Ġretur n",
      "stra ct",
      "Ġasynchron ous",
      "' )",
      "' )\"",
      ") :",
      ") ;",
      "C lass",
      "E x",
      "a in",
      "e m",
      "f unction",
      "n ate",
      "p a",
      "p p",
      "r u",
      "r ow",
      "s it",
      "t ain",
      "Ġ (",
      "Ġ 1",
      "Ġ C",
      "Ġ S",
      "Ġc ur",
      "us t",
      "Ġm ax",
      "or y",
      "ate nate",
      "Ġus e",
      "Ġus ed",
      "Ġb ra",
      "Ġt uple",
      "Ġp ip",
      "Ġre po",
      "() \"",
      "Ġw h",
      "Ġde c",
      "Ġdef ine",
      "Ġit em",
      "Ġle n",
      "Ġop er",
      "Ġasyn c",
      "Ġar ray",
      "ren t",
      "Ġpla cing",
      "Ġrem ove",
      "Ġconc atenate",
      "Ġmulti ple",
      "sit ory",
      "Ġrepo sitory",
      "f i",
      "g es",
      "h er",
      "h en",
      "i g",
      "i m",
      "l ine",
      "m m",
      "m y",
      "n ew",
      "o th",
      "p ar",
      "r y",
      "s ion",
      "t x",
      "t ime",
      "Ġ `",
      "in st",
      "Ġa llow",
      "Ġa pp",
      "Ġc sv",
      "le t",
      "Ġf et",
      "Ġf lo",
      "us h",
      "Ġm er",
      "er f",
      "ate d",
      "en d",
      "Ġt ry",
      "Ġs pe",
      "Ġs erver",
      "Ġp ush",
      "Ġo s",
      "Ġ= >",
      "Ġre quest",
      "Ġn ot",
      "me thod",
      "Ġcon tain",
      "Ġcom pre",
      "mp le",
      "se par",
      "Ġmethod s",
      "mb er",
      "Ġcomm a",
      "ation s",
      "Ġiter ate",
      "Ġiter able",
      "Ġexception s",
      "Ġab stract",
      "Ġcl one",
      "tt p",
      "ĠMy Class",
      "Ġdate time",
      "Ġconst ru",
      "her it",
      "hen sion",
      "tx t",
      "inst ance",
      "Ġfet ch",
      "Ġflo at",
      "Ġmer ge",
      "Ġspe ci",
      "Ġcompre hension",
      "separ ated",
      "Ġconstru ctor",
      "' '",
      ") :\"",
      ") ;\"",
      ". _",
      "/ /",
      "H e",
      "I n",
      "a ce",
      "a wait",
      "c on",
      "d d",
      "d ata",
      "e g",
      "g th",
      "h is",
      "i e",
      "i z",
      "i ch",
      "i de",
      "l f",
      "l s",
      "m pt",
      "p m",
      "s ponse",
      "s ide",
      "u b",
      "u al",
      "Ġ *",
      "Ġ -",
      "Ġ [",
      "Ġ }\"",
      "in t",
      "in es",
      "Ġa wait",
      "Ġa dd",
      "Ġin herit",
      "Ġin side",
      "is e",
      "re sponse",
      "ing let",
      "Ġl it",
      "Ġm a",
      "Ġm ap",
      "er al",
      "or ator",
      "en v",
      "Ġan oth",
      "Ġt ime",
      "Ġcreate d",
      "la r",
      "la re",
      "Ġp ar",
      "Ġp rom",
      "ss ion",
      "Ġe mpt",
      "st ring",
      "Ġi mm",
      "Ġn pm",
      "ll o",
      "ar g",
      "mp y",
      "se lf",
      "Ġh a",
      "Ġh ttp",
      "Ġch an",
      "__ (",
      "Ġstring s",
      "Ġint erf",
      "Ġint eg",
      "ite m",
      "Ġloop s",
      "pre ssion",
      "ĠĠĠĠ ĠĠĠ",
      "Ġcl s",
      "Ġres ponse",
      "ut able",
      "Ġnu mber",
      "Ġnu mpy",
      "Ġdefault dict",
      "Ex ception",
      "Ġ1 0",
      "Ġcur ly",
      "ust om",
      "Ġbra ces",
      "Ġwh ich",
      "Ġdec lare",
      "Ġlen gth",
      "Ġoper ations",
      "Ġapp end",
      "He llo",
      "inglet on",
      "Ġlit eral",
      "Ġanoth er",
      "Ġempt y",
      "Ġimm utable",
      "Ġinterf ace",
      "$ {",
      "' \"",
      "' :",
      ". \",",
      "0 0",
      "1 2",
      ": \\",
      ": //",
      "A B",
      "A r",
      "E T",
      "F al",
      "H andle",
      "N one",
      "O S",
      "R e",
      "S V",
      "S erver",
      "W or",
      "] \"",
      "a re",
      "a vi",
      "a mple",
      "b ut",
      "c at",
      "c ke",
      "c om",
      "c ap",
      "c sv",
      "c ls",
      "d ing",
      "e mp",
      "e lement",
      "f e",
      "f y",
      "f fe",
      "g u",
      "g ra",
      "h t",
      "h avi",
      "i c",
      "i al",
      "i ld",
      "i mple",
      "j o",
      "j s",
      "k ing",
      "l le",
      "l ate",
      "m in",
      "m or",
      "n ing",
      "n ow",
      "o re",
      "o le",
      "o ly",
      "o lle",
      "p y",
      "p ip",
      "p his",
      "r t",
      "r un",
      "r ce",
      "s u",
      "s et",
      "s ed",
      "s ort",
      "s ul",
      "s erver",
      "s ole",
      "t s",
      "t er",
      "t ex",
      "t uple",
      "u m",
      "u p",
      "v env",
      "Ġ 0",
      "Ġ 4",
      "Ġ <",
      "Ġ @",
      "Ġ T",
      "Ġ x",
      "Ġ You",
      "Ġ one",
      "Ġ vi",
      "Ġ ${",
      "Ġ Fal",
      "Ġ None",
      "Ġ run",
      "Ġ venv",
      "in d",
      "th en",
      "th es",
      "Ġa t",
      "Ġa tt",
      "Ġc ustom",
      "Ġc olle",
      "Ġin it",
      "Ġth row",
      "re ad",
      "re ctor",
      "ĠP OS",
      "Ġl ine",
      "Ġl ines",
      "Ġf ind",
      "Ġm ig",
      "er ator",
      "er min",
      "it y",
      "ou rce",
      "Ġdo es",
      "en erator",
      "Ġt emp",
      "Ġt ermin",
      "la mbda",
      "Ġs ame",
      "Ġs qu",
      "Ġs ingleton",
      "ction s",
      "Ġp ython",
      "ri me",
      "ri but",
      "Ġre ver",
      "() :\"",
      "ce d",
      "Ġfunction s",
      "ent s",
      "Ġcon sole",
      "Ġcom pa",
      "Ġdef in",
      "Ġdef init",
      "ment s",
      "Ġdi ffe",
      "Ġdi rector",
      "Ġex pression",
      "lo g",
      "lo ad",
      "Ġmod e",
      "Ġpa ss",
      "Ġpa ren",
      "Ġpa rent",
      "Ġch ild",
      "__ .",
      "Ġg et",
      "Ġg enerator",
      "Ġy ie",
      "Ġimp lement",
      "ot e",
      "Ġbranch es",
      "Ġhandle s",
      "Ġpacka ges",
      "Ġblock s",
      "Ġyou r",
      "HTTP Re",
      "ron ment",
      "Ġab c",
      "Ġar gu",
      "Ġover load",
      "Ġobject s",
      "quest ion",
      "quest Handle",
      "de f",
      "ex ists",
      "ĠHTTP Server",
      "Ġbe havi",
      "Ġsort ed",
      "Ġpla ced",
      "Ġrem ote",
      "Ġres ult",
      "Ġres ource",
      "Ġread er",
      "vi ronment",
      "Ġen su",
      "Ġen vironment",
      "Ġpr o",
      "Ġpr int",
      "): \\",
      "pa th",
      "ĠC ode",
      "ĠC SV",
      "ĠS et",
      "ĠS imple",
      "Ġcur rent",
      "Ġmax im",
      "Ġbra cke",
      "Ġwh ile",
      "Ġdec orator",
      "Ġarray s"
    ]
  }
}